import Routes from "@/assets/data/routes";

export const Data = {
  title: "ঠিকানা সংবলিত তথ্য",
  submit: "ঠিকানা জমা দিন",
  wait: "অপেক্ষা করুন",

  success: {
    title: "ঠিকানা সংবলিত তথ্য সফলভাবে খোলা হয়েছে।",
    description:
      "আপনার ঠিকানা সংবলিত তথ্য সফলভাবে খোলা হয়েছে। অনুগ্রহ করে, পরবর্তি ধাপ এর তথ্যগুলো পূরণ করুন।",
    redirectUrl: Routes.profile_bio.education.create,
  },
  error: {
    title: "ঠিকানা সংবলিত তথ্য সংরক্ষন করা সম্ভব হয়নি।",
    description:
      "আপনার ঠিকানা সংবলিত তথ্য সংরক্ষন করা সম্ভব হয়নি। অনুগ্রহ করে আবার চেষ্টা করুন।",
    403: {
      title: "আপনি ইতোপূর্বে বায়ো ডাটার ঠিকানা সংবলিত তথ্য তৈরী করেছেন।",
      description: "দয়া করে পূর্বের তৈরী করা বায়ো ডাটাটি ইডিট করুন।",
    },
    422: {
      title: "ঠিকানা সংবলিত তথ্যসমূহ সঠিকভাবে পূরন করা হয়নি।",
      description:
        "আপনার ঠিকানা সংবলিত তথ্য সংরক্ষন করা সম্ভব হয়নি। অনুগ্রহ করে আবার চেষ্টা করুন।",
    },
  },
  inputs: {
    permanent_address: {
      title: "স্থায়ী ঠিকানা",
      placeholder: "স্থায়ী ঠিকানা লিখুন",
      suggestions: [
        "বাডির নাম, বাসার নম্বর ইত্যাদি উল্ল্যেখ ব্যাতিত আপনার  স্থায়ী ঠিকানা উল্ল্যেখ করুন।",
        "স্থায়ী ঠিকানায় আপনার জীবনে অতিবাহিত সময়কাল উল্ল্যেখ করুন।",
      ],
    },
    present_address: {
      title: "বর্তমান ঠিকানা",
      placeholder: "বর্তমান ঠিকানা লিখুন",
      suggestions: [
        "বাডির নাম, বাসার নম্বর ইত্যাদি উল্ল্যেখ ব্যাতিত আপনার  বর্তমান ঠিকানা উল্ল্যেখ করুন।",
        "বর্তমান ঠিকানায় আপনার জীবনে অতিবাহিত সময়কাল উল্ল্যেখ করুন।",
      ],
    },
    relocate_plan: {
      title: "স্থানান্তর পরিকল্পনা",
      placeholder: "স্থানান্তর পরিকল্পনা লিখুন",
      suggestions: [
        "বর্তমান ঠিকানা হতে অন্যত্র স্থানন্তরিত হওয়ার পরিকল্পনা থাকলে তবে তা উল্ল্যেখ করুন।",
      ],
    },
    childhood_address: {
      title: "শৈশবের ঠিকানা",
      placeholder: "শৈশবের ঠিকানা লিখুন",
      suggestions: [
        "আপনার শৈশব জীবন অতিবাহিত হওয়ার স্থান সম্পর্কে বিস্তারিত উল্ল্যেখ করুন।",
      ],
    },
  },
  unKnownError: {
    title: "কিছুটা সমস্যা হয়েছে!",
    description:
      "কর্তৃপক্ষের সাথে সাপোর্ট এর মাধ্যমে যোগাযোগ করুন। এবং আপনার সমস্যার বিষয়টি তাদেরকে জানান। ",
  },
};
// Validation Massage
export const VM = {
  permanent_address: {
    required: "স্থায়ী ঠিকানা আবশ্যক।",
    maxLength: "স্থায়ী ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  present_address: {
    maxLength: "স্থায়ী ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  relocate_plan: {
    maxLength: "স্থায়ী ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  childhood_address: {
    maxLength: "স্থায়ী ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
};
