import Routes from "@/assets/data/routes";

export const Data = {
  title: "প্রত্যাশিত জীবনসঙ্গী",
  submit: "আপডেট করুন",
  wait: "অপেক্ষা করুন...",

  success: {
    title: "প্রত্যাশিত জীবনসঙ্গীর তথ্য সফলভাবে আপডেট হয়েছে",
    description:
      "আপনার প্রত্যাশিত জীবনসঙ্গীর তথ্য সফলভাবে আপডেট হয়েছে। প্রয়োজন অনুযায়ী অন্য তথ্য আপডেট করুন।",
    redirectUrl: Routes.Profile,
  },
  error: {
    title: "প্রত্যাশিত জীবনসঙ্গীর তথ্য আপডেট করা সম্ভব হয়নি",
    description:
      "আপনার প্রত্যাশিত জীবনসঙ্গীর তথ্য আপডেট করা সম্ভব হয়নি। অনুগ্রহ করে আবার চেষ্টা করুন।",
    tryAgainDescription: "দয়া করে সংশোধনী মেনে পুনরায় চেষ্টা করুন।",
    422: {
      title: "প্রত্যাশিত জীবনসঙ্গীর তথ্য সঠিকভাবে পূর্ণ করা হয়নি",
      description:
        "আপনার প্রত্যাশিত জীবনসঙ্গীর তথ্য সঠিকভাবে আপডেট করা সম্ভব হয়নি। দয়া করে যাচাই করুন এবং পুনরায় চেষ্টা করুন।",
    },
  },

  inputs: {
    age: {
      title: "প্রত্যাশিত জীবনসঙ্গীর বয়স",
      placeholder: "আপনার প্রত্যাশিত জীবনসঙ্গীর কেমন বয়স আশা করেন?",
      suggestions: ["আপনার প্রত্যাশিত জীবনসঙ্গীর বয়সের সীমা উল্লেখ করুন।"],
    },
    height: {
      title: "প্রত্যাশিত জীবনসঙ্গীর উচ্চতা",
      placeholder: "আপনার প্রত্যাশিত জীবনসঙ্গীর কেমন উচ্চতা আশা করেন?",
      suggestions: ["আপনার প্রত্যাশিত জীবনসঙ্গীর উচ্চতার সীমা উল্লেখ করুন।"],
    },
    complexion: {
      title: "প্রত্যাশিত জীবনসঙ্গীর গাত্রবর্ণ",
      triggerText: "আপনার প্রত্যাশিত জীবনসঙ্গীর গাত্রবর্ণ নির্বাচন করুন",
    },
    marital_status: {
      title: "প্রত্যাশিত জীবনসঙ্গীর বৈবাহিক অবস্থা",
      triggerText: "আপনার প্রত্যাশিত জীবনসঙ্গীর বৈবাহিক অবস্থা নির্বাচন করুন",
    },
    educational_qualification: {
      title: "প্রত্যাশিত জীবনসঙ্গীর শিক্ষাগত যোগ্যতা",
      placeholder:
        "আপনার প্রত্যাশিত জীবনসঙ্গীর কেমন শিক্ষাগত যোগ্যতা আশা করেন?",
      suggestions: [
        "আপনার প্রত্যাশিত জীবনসঙ্গীর শিক্ষাগত যোগ্যতা কেমন হওয়া উচিত বলে আপনি মনে করেন?",
      ],
    },
    profession: {
      title: "প্রত্যাশিত জীবনসঙ্গীর পেশা",
      placeholder: "আপনার প্রত্যাশিত জীবনসঙ্গীর কেমন পেশা আশা করেন?",
      suggestions: [
        "যে পেশায় আপনার প্রত্যাশিত জীবনসঙ্গী কাজ করবেন তা উল্লেখ করুন।",
        "আপনার পছন্দের পেশার ক্ষেত্রে কিছু বিস্তারিত বিবরণ দিন।",
      ],
    },
    economic_status: {
      title: "প্রত্যাশিত জীবনসঙ্গীর আর্থিক অবস্থা",
      placeholder: "আপনার প্রত্যাশিত জীবনসঙ্গীর কেমন আর্থিক অবস্থা আশা করেন?",
      suggestions: [
        "একজন জীবনসঙ্গীর জন্য আপনার আর্থিক স্থিতিশীলতার চাহিদা উল্লেখ করুন।",
      ],
    },
    bio_profile_types: {
      title: "প্রত্যাশিত জীবনসঙ্গীর প্রোফাইলের ধরন",
      triggerText: "আপনার প্রত্যাশিত জীবনসঙ্গীর প্রোফাইলের ধরন নির্বাচন করুন",
      suggestions: [
        "প্রত্যাশিত জীবনসঙ্গীর ধর্মীয় অনুশীলনের মাত্রা বিবেচনা করে প্রোফাইলের ধরন নির্বাচন করুন।",
      ],
    },
    family: {
      title: "প্রত্যাশিত জীবনসঙ্গীর পারিবারিক অবস্থা",
      placeholder:
        "আপনার প্রত্যাশিত জীবনসঙ্গীর পারিবারিক অবস্থা কেমন হবে আশা করেন?",
      suggestions: [
        "পারিবারিক অবস্থা সম্পর্কে আপনার চিন্তাভাবনা প্রকাশ করুন।",
        "আপনার প্রত্যাশিত জীবনসঙ্গীর পরিবারের সম্পর্কে আপনার প্রত্যাশা উল্লেখ করুন।",
      ],
    },
    about_partner: {
      title: "পছন্দের জীবনসঙ্গী সম্পর্কে বিস্তারিত",
      placeholder:
        "আপনার প্রত্যাশিত জীবনসঙ্গী সম্পর্কে আপনার আশা ও ইচ্ছা ব্যক্ত করুন।",
      suggestions: [
        "আপনার প্রত্যাশিত জীবনসঙ্গীর ব্যক্তিত্ব ও গুণাবলীর বিষয়ে লিখুন।",
        "একজন আদর্শ জীবনসঙ্গী হিসেবে আপনি তাকে কেমনভাবে দেখতে চান তা বর্ণনা করুন।",
      ],
    },
  },
  unKnownError: {
    title: "কিছু সমস্যা ঘটেছে!",
    description:
      "দয়া করে কর্তৃপক্ষের সাথে যোগাযোগ করুন এবং আপনার সমস্যার বিস্তারিত জানাবেন।",
  },
};

// Validation Messages
export const VM = {
  age: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর বয়স উল্লেখ করা আবশ্যক।",
    minLength: "প্রত্যাশিত জীবনসঙ্গীর বয়স সর্বনিম্ন ১ অক্ষর হতে হবে।",
    maxLength: "প্রত্যাশিত জীবনসঙ্গীর বয়স সর্বাধিক ২৫০ অক্ষর হতে পারবে।",
  },
  height: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর উচ্চতা উল্লেখ করা আবশ্যক।",
    minLength: "উচ্চতা সর্বনিম্ন ১ অক্ষর হতে হবে।",
    maxLength: "উচ্চতা সর্বাধিক ২৫০ অক্ষর হতে পারবে।",
  },
  complexion: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর গাত্রবর্ণ নির্বাচন করা আবশ্যক।",
    minLength: "গাত্রবর্ণ সর্বনিম্ন ২ অক্ষর হতে হবে।",
    maxLength: "গাত্রবর্ণ সর্বাধিক ১৫০ অক্ষর হতে পারবে।",
  },
  marital_status: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর বৈবাহিক অবস্থা নির্বাচন করা আবশ্যক।",
  },
  educational_qualification: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর শিক্ষাগত যোগ্যতা প্রদান করা আবশ্যক।",
    minLength: "শিক্ষাগত যোগ্যতা সর্বনিম্ন ১ অক্ষর হতে হবে।",
    maxLength: "শিক্ষাগত যোগ্যতা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  profession: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর পেশা প্রদান করা আবশ্যক।",
    minLength: "পেশা সর্বনিম্ন ১ অক্ষর হতে হবে।",
    maxLength: "পেশা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  economic_status: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর আর্থিক অবস্থা প্রদান করা আবশ্যক।",
    minLength: "আর্থিক অবস্থার তথ্য সর্বনিম্ন ১ অক্ষর হতে হবে।",
    maxLength: "আর্থিক অবস্থার তথ্য সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  bio_profile_types: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর প্রোফাইলের ধরন নির্বাচন করা আবশ্যক।",
  },
  family: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গীর পারিবারিক অবস্থা উল্লেখ করা আবশ্যক।",
    minLength: "পারিবারিক অবস্থার বিবরণ সর্বনিম্ন ১ অক্ষর হতে হবে।",
    maxLength: "পারিবারিক অবস্থার বিবরণ সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  about_partner: {
    required: "আপনার প্রত্যাশিত জীবনসঙ্গী সম্পর্কে ধারণা প্রদান করা আবশ্যক।",
    minLength: "পছন্দের সঙ্গী সম্পর্কিত তথ্য সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength: "পছন্দের সঙ্গী সম্পর্কিত তথ্য সর্বাধিক ১৫০০ অক্ষর হতে পারবে।",
  },
};
