import Routes from "@/assets/data/routes";
const profileBio = Routes.profile_bio;
export const Data = {
  initialText: "আপনি ইতোপূর্বে কোন বায়োডাটা ক্রিয়েট করেন নাই।",
  moveToLongText:
    "আপনার বায়োডাটাটি সংক্ষিপ্ত অবস্থায় আছে। এটিকে বিস্তারিত বায়োডাটায় পরিবর্তন করুন।",
  wait: "অপেক্ষা করুন...",

  bio: {
    create: {
      link: Routes.bio.create,
      label: "বায়োডাটা তৈরী করুন।",
    },
    edit: {
      short: {
        link: Routes.profile_bio.short_bio.edit,
        label: "বায়োডাটা সংশোধন করুন।",
      },
    },
    moveToLong: {
      label: "বিস্তারিত বায়োডাটায় পরিবর্তন করুন",
      success: {
        title: "বায়োডাটা সফলভাবে আপডেট হয়েছে!",
        description:
          "আপনার বায়োডাটা সংক্ষিপ্ত থেকে বিস্তারিত সংস্করণে সফলভাবে পরিবর্তন করা হয়েছে। এখনই প্রয়োজনীয় তথ্য যোগ করে আপনার বায়োডাটা সম্পূর্ণ করুন।",
        redirectUrl: Routes.profile_bio.general.edit,
      },
      unKnownError: {
        title: "কিছু সমস্যা ঘটেছে!",
        description:
          "দয়া করে কর্তৃপক্ষের সাথে যোগাযোগ করুন এবং আপনার সমস্যার বিস্তারিত জানাবেন।",
      },
    },
  },
  general: {
    label: "সাধারন তথ্য",
    create: {
      text: "আপনি এখনো সাধারণ তথ্য প্রদান করেননি। অনুগ্রহ করে সাধারণ তথ্য তৈরী করুন।",
      link: profileBio.general.create,
      label: "বায়োডাটা তৈরী করুন। (সাধারন তথ্য - ১/১০)",
    },
    edit: {
      text: "আপনার সাধারণ তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার সাধারণ তথ্য সম্পূর্ণ করুন।",
      link: profileBio.general.edit,
      label: "সাধারন তথ্য সংশোধন করুন।",
    },
  },
  location: {
    label: "ঠিকানা",
    create: {
      text: "আপনি এখনো ঠিকানা সম্পর্কিত তথ্য প্রদান করেননি। অনুগ্রহ করে ঠিকানা সম্পর্কিত তথ্য তৈরী করুন।",
      link: profileBio.location.create,
      label: "বায়োডাটা তৈরী করুন। (ঠিকানা - ২/১০)",
    },
    edit: {
      text: "আপনার ঠিকানা সম্পর্কিত তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার ঠিকানা সম্পর্কিত তথ্য সম্পূর্ণ করুন।",
      link: profileBio.location.edit,
      label: "ঠিকানা সংশোধন করুন।",
    },
  },
  education: {
    label: "শিক্ষা",
    create: {
      text: "আপনি এখনো শিক্ষা সম্পর্কিত তথ্য প্রদান করেননি। অনুগ্রহ করে শিক্ষা সম্পর্কিত তথ্য তৈরী করুন।",
      link: profileBio.education.create,
      label: "বায়োডাটা তৈরী করুন। (শিক্ষা - ৩/১০)",
    },
    edit: {
      text: "আপনার শিক্ষা সম্পর্কিত তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার শিক্ষা সম্পর্কিত তথ্য সম্পূর্ণ করুন।",
      link: profileBio.education.edit,
      label: "শিক্ষা সংশোধন করুন।",
    },
  },
  personal_info: {
    label: "ব্যাক্তিগত তথ্য",
    create: {
      text: "আপনি এখনো ব্যাক্তিগত তথ্য প্রদান করেননি। অনুগ্রহ করে ব্যাক্তিগত তথ্য তৈরী করুন।",
      link: profileBio.personal_info.create,
      label: "বায়োডাটা তৈরী করুন। (ব্যাক্তিগত তথ্য - ৪/১০)",
    },
    edit: {
      text: "আপনার ব্যাক্তিগত তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার ব্যাক্তিগত তথ্য সম্পূর্ণ করুন।",
      link: profileBio.personal_info.edit,
      label: "ব্যাক্তিগত তথ্য সংশোধন করুন।",
    },
  },
  family: {
    label: "পারিবারিক তথ্য",
    create: {
      text: "আপনি এখনো পারিবারিক তথ্য প্রদান করেননি। অনুগ্রহ করে পারিবারিক তথ্য তৈরী করুন।",
      link: profileBio.family.create,
      label: "বায়োডাটা তৈরী করুন। (পারিবারিক তথ্য - ৫/১০)",
    },
    edit: {
      text: "আপনার পারিবারিক তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার পারিবারিক তথ্য সম্পূর্ণ করুন।",
      link: profileBio.family.edit,
      label: "পারিবারিক তথ্য সংশোধন করুন।",
    },
  },
  profession: {
    label: "পেশা",
    create: {
      text: "আপনি এখনো পেশাগত তথ্য প্রদান করেননি। অনুগ্রহ করে পেশাগত তথ্য তৈরী করুন।",
      link: profileBio.profession.create,
      label: "বায়োডাটা তৈরী করুন। (পেশা - ৬/১০)",
    },
    edit: {
      text: "আপনার পেশাগত তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার পেশাগত তথ্য সম্পূর্ণ করুন।",
      link: profileBio.profession.edit,
      label: "পেশা সংশোধন করুন।",
    },
  },
  religious: {
    label: "ধর্ম",
    create: {
      text: "আপনি এখনো ধার্মিকতা সম্পর্কিত তথ্য প্রদান করেননি। অনুগ্রহ করে ধার্মিকতা সম্পর্কিত তথ্য তৈরী করুন।",
      link: profileBio.religious_activities.create,
      label: "বায়োডাটা তৈরী করুন। (ধর্ম - ৭/১০)",
    },
    edit: {
      text: "আপনার ধার্মিকতা সম্পর্কিত তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার ধার্মিকতা সম্পর্কিত তথ্য সম্পূর্ণ করুন।",
      link: profileBio.religious_activities.edit,
      label: "ধর্ম সংশোধন করুন।",
    },
  },
  marital: {
    label: "বৈবাহিক তথ্য",
    create: {
      text: "আপনি এখনো বিবাহ সম্পর্কিত তথ্য প্রদান করেননি। অনুগ্রহ করে বিবাহ সম্পর্কিত তথ্য তৈরী করুন।",
      link: profileBio.marital_info.create,
      label: "বায়োডাটা তৈরী করুন। (বৈবাহিক তথ্য - ৮/১০)",
    },
    edit: {
      text: "আপনার বিবাহ সম্পর্কিত তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার বিবাহ সম্পর্কিত তথ্য সম্পূর্ণ করুন।",
      link: profileBio.marital_info.edit,
      label: "বৈবাহিক তথ্য সংশোধন করুন।",
    },
  },
  expected_partner: {
    label: "প্রত্যাশিত জীবনসঙ্গী",
    create: {
      text: "আপনি এখনো প্রত্যাশিত জীবনসঙ্গী সম্পর্কিত তথ্য প্রদান করেননি। অনুগ্রহ করে প্রত্যাশিত জীবনসঙ্গী সম্পর্কিত তথ্য তৈরী করুন।",
      link: profileBio.expected_partner.create,
      label: "বায়োডাটা তৈরী করুন। (প্রত্যাশিত জীবনসঙ্গী - ৯/১০)",
    },
    edit: {
      text: "আপনার প্রত্যাশিত জীবনসঙ্গী সম্পর্কিত তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার প্রত্যাশিত জীবনসঙ্গী সম্পর্কিত তথ্য সম্পূর্ণ করুন।",
      link: profileBio.expected_partner.edit,
      label: "প্রত্যাশিত জীবনসঙ্গী সংশোধন করুন।",
    },
  },
  hidden: {
    label: "গোপনীয় তথ্য",
    create: {
      text: "আপনি এখনো প্রত্যাশিত গোপনীয় তথ্য প্রদান করেননি। অনুগ্রহ করে প্রত্যাশিত গোপনীয় তথ্য তৈরী করুন।",
      link: profileBio.hidden_info.create,
      label: "বায়োডাটা তৈরী করুন। (গোপনীয় তথ্য - ১০/১০)",
    },
    edit: {
      text: "আপনার প্রত্যাশিত গোপনীয় তথ্য অসম্পূর্ণ রয়েছে। অনুগ্রহ করে আপনার প্রত্যাশিত গোপনীয় তথ্য সম্পূর্ণ করুন।",
      link: profileBio.hidden_info.edit,
      label: "গোপনীয় তথ্য সংশোধন করুন।",
    },
  },
};
