import Routes from "@/assets/data/routes";

export const Data = {
  title: "সংক্ষিপ্ত বায়োডাটা",
  submit: "জমা দিন",
  wait: "অপেক্ষা করুন...",
  hiddenInfo: {
    title: "গোপনীয় তথ্যাবলি",
  },
  create: {
    success: {
      title: "সংক্ষিপ্ত বায়োডাটা তথ্য সফলভাবে জমা হয়েছে",
      description:
        "আপনার বায়োডাটার সংক্ষিপ্ত বায়োডাটা তথ্য সফলভাবে জমা হয়েছে। অনুগ্রহ করে পরবর্তী ধাপের তথ্য পূরণ করুন।",
      redirectUrl: Routes.profile_bio.url,
    },
    error: {
      title: "সংক্ষিপ্ত বায়োডাটা তথ্য জমা করা সম্ভব হয়নি",
      description:
        "আপনার বায়োডাটার সংক্ষিপ্ত বায়োডাটা তথ্য জমা করা সম্ভব হয়নি। অনুগ্রহ করে আবার চেষ্টা করুন।",
      tryAgainDescription: "দয়া করে সংশোধনী মেনে পুনরায় চেষ্টা করুন।",
      403: {
        title: "আপনার বায়োডাটার সংক্ষিপ্ত বায়োডাটা তথ্য ইতোমধ্যে বিদ্যমান",
        description: "আপনার পূর্বে জমা করা বায়োডাটা সম্পাদনা করুন।",
      },
      422: {
        title: "সংক্ষিপ্ত বায়োডাটা তথ্য সঠিকভাবে পূরণ করা হয়নি",
        description:
          "আপনার সাধারণ তথ্য জমা করা সম্ভব হয়নি। দয়া করে যাচাই করুন এবং পুনরায় চেষ্টা করুন।",
      },
    },
  },
  edit: {
    success: {
      title: " সংক্ষিপ্ত বায়োডাটা তথ্য সফলভাবে আপডেট হয়েছে",
      description: "আপনার  সংক্ষিপ্ত বায়োডাটা তথ্য সফলভাবে আপডেট হয়েছে।",
      redirectUrl: Routes.profile_bio.url,
    },
    error: {
      title: "সংক্ষিপ্ত বায়োডাটা তথ্য আপডেট করা সম্ভব হয়নি",
      description:
        "আপনার সংক্ষিপ্ত বায়োডাটা তথ্য আপডেট করা সম্ভব হয়নি। অনুগ্রহ করে আবার চেষ্টা করুন।",
      tryAgainDescription: "দয়া করে সংশোধনী মেনে পুনরায় চেষ্টা করুন।",
      422: {
        title: "সংক্ষিপ্ত বায়োডাটা তথ্য সঠিকভাবে পূর্ণ করা হয়নি",
        description:
          "আপনার সংক্ষিপ্ত বায়োডাটা তথ্য সঠিকভাবে আপডেট করা সম্ভব হয়নি। দয়া করে যাচাই করুন এবং পুনরায় চেষ্টা করুন।",
      },
    },
  },

  inputs: {
    gender: {
      title: "বায়োডাটার ধরন",
      triggerText: "আপনার বায়োডাটার ধরন নির্বাচন করুন",
    },
    marital_status: {
      title: "বৈবাহিক অবস্থা",
      triggerText: "আপনার বৈবাহিক অবস্থা নির্বাচন করুন",
    },
    birth_date: {
      title: "জন্ম তারিখ",
      placeholder: "আপনার জন্ম তারিখ নির্ধারণ করুন",
    },
    height: {
      title: "উচ্চতা",
      triggerText: "আপনার উচ্চতা নির্বাচন করুন",
    },
    weight: {
      title: "ওজন",
      triggerText: "আপনার ওজন নির্বাচন করুন",
    },
    complexion: {
      title: "গাত্রবর্ণ",
      triggerText: "আপনার গাত্রবর্ণ নির্বাচন করুন",
    },
    blood_group: {
      title: "রক্তের গ্রুপ",
      triggerText: "আপনার রক্তের গ্রুপ নির্বাচন করুন",
    },
    language_skills: {
      title: "ভাষাগত দক্ষতা",
      placeholder: "উদাহরণ: বাংলা, ইংরেজি, আরবি",
    },
    location: {
      hintText: "ঠিকানা নির্বাচন করুন",
      triggerText: "আপনার ঠিকানা নির্বাচন করুন",
      label: "ঠিকানা নির্বাচন করুন",
    },
    permanent_address: {
      title: "স্থায়ী ঠিকানা",
      placeholder: "স্থায়ী ঠিকানা লিখুন",
      suggestions: [
        "বাড়ির নাম বা বাসার নম্বর ব্যতীত আপনার স্থায়ী ঠিকানার বিবরণ দিন।",
        "স্থায়ী ঠিকানায় আপনার বসবাসের সময়কাল উল্লেখ করুন।",
        "আপনার স্থায়ী ঠিকানায় বাড়ির নাম, বাসার নম্বর বা এলাকার সুনির্দিষ্ট নাম উল্লেখ করা এড়িয়ে চলুন।",
      ],
    },
    education_medium: {
      title: "শিক্ষার মাধ্যম",
      triggerText: "আপনার শিক্ষা প্রতিষ্ঠানের শিক্ষার মাধ্যম নির্বাচন করুন",
    },
    previous_exams: {
      title: "পূর্ববর্তী পরীক্ষা ও তার ফলাফল",
      placeholder: "পূর্ববর্তী পরীক্ষার তথ্য লিখুন",
      suggestions: [
        "আপনার পূর্ববর্তী পরীক্ষার বিস্তারিত তথ্য দিন, যেমন: পরীক্ষার নাম, সাল, প্রতিষ্ঠান, বিভাগ এবং প্রাপ্ত ফলাফল।",
        "যদি কোনো বিশেষ পরীক্ষার ফলাফল থাকে, তা উল্লেখ করুন।",
      ],
    },
    family_members_info: {
      title: "পারিবারিক সদস্যদের তথ্য",
      placeholder: "আপনার পরিবারের সদস্যদের তথ্য দিন",
      suggestions: [
        "আপনার পরিবারের সদস্যদের বয়স, সম্পর্কের ধরন, পেশা, শিক্ষা ও কর্মজীবনের অবস্থা সম্পর্কে বিস্তারিত তথ্য দিন।",
        "আপনার পরিবারের সদস্যদের নাম বা পরিচয় সম্পর্কিত তথ্য শেয়ার করা থেকে বিরত থাকুন।",
      ],
    },
    economic_status: {
      title: "আর্থিক অবস্থা",
      triggerText: "আপনার পরিবারের আর্থিক অবস্থা নির্বাচন করুন",
    },
    profession: {
      title: "পেশা",
      triggerText: "আপনার পেশা নির্বাচন করুন",
    },
    profession_description: {
      title: "পেশার বর্ণনা",
      placeholder: "আপনার পেশার বর্ণনা দিন",
      suggestions: [
        "আপনার পেশার প্রধান দায়িত্ব ও কাজের বিবরণ প্রদান করুন।",
        "আপনার কর্মক্ষেত্র এবং কর্মস্থল সম্পর্কিত তথ্য উল্লেখ করুন।",
      ],
    },
    mazhab: {
      title: "মাযহাব",
      triggerText: "আপনার মাযহাব নির্বাচন করুন",
    },
    prev_marriage: {
      title: "পূর্ববর্তী বিবাহ",
      placeholder: "পূর্ববর্তী বিবাহ সংক্রান্ত তথ্য লিখুন",
      suggestions: [
        "আপনার পূর্ববর্তী বিবাহের সময়কাল, বিবাহবিচ্ছেদের কারণ, সন্তানের সংখ্যা ও তাদের বর্তমান অবস্থা ইত্যাদি বিস্তারিতভাবে উল্লেখ করুন।",
      ],
    },
    name: {
      title: "নাম",
      placeholder: "আপনার নাম লিখুন",
      suggestions: [
        "আপনার পূর্ণ নাম লিখুন।",
        "যদি আপনার নামের কোনও ডাকনাম থাকে, তা উল্লেখ করতে পারেন।",
      ],
    },
    email: {
      title: "ইমেইল",
      placeholder: "আপনার ইমেইল ঠিকানা লিখুন",
      suggestions: [
        "আপনার সাথে যোগাযোগ করার জন্য এবং বায়োডাটা গ্রহণের প্রক্রিয়া সঠিকভাবে সম্পন্ন করার জন্য একটি সক্রিয় ইমেইল ঠিকানা দিন।",
      ],
    },
    hiddenLocation: {
      title: "ঠিকানা",
      placeholder: "আপনার বিস্তারিত ঠিকানা লিখুন",
      suggestions: [
        "আপনার বাড়ির নাম, বাসার নম্বর এবং এলাকার নাম উল্লেখ করে পুরো ঠিকানা দিন, যেমন: গ্রাম, নিকটস্থ বাজার, অথবা স্থানীয় উল্লেখযোগ্য স্থান।",
        "যাতায়াতের সুবিধা সম্পর্কে তথ্য দিন, যেমন: পাবলিক ট্রান্সপোর্টের নিকটতা অথবা সড়কের অবস্থা।",
      ],
    },
    family_members_name: {
      title: "পরিবারের সদস্যদের নাম",
      placeholder: "পরিবারের সদস্যদের নাম লিখুন",
      suggestions: ["পরিবারের সদস্যদের নাম এবং সম্পর্কের ধরন উল্লেখ করুন।"],
    },
    current_parent: {
      title: "বর্তমান অভিভাবক",
      placeholder: "বর্তমান অভিভাবকের নাম লিখুন",
    },
    parent_mobile: {
      title: "অভিভাবকের মোবাইল নম্বর",
      placeholder: "অভিভাবকের মোবাইল নম্বর লিখুন",
      suggestions: [
        "আপনার অভিভাবকের সক্রিয় মোবাইল নম্বর দিন, যাতে সহজে যোগাযোগ করা যেতে পারে।",
        "প্রয়োজনে বিকল্প যোগাযোগের জন্য একাধিক নম্বর প্রদান করুন।",
      ],
    },
  },

  unKnownError: {
    title: "একটি সমস্যা হয়েছে!",
    description:
      "দয়া করে সাপোর্ট টিমের সাথে যোগাযোগ করুন এবং সমস্যার বিস্তারিত জানিয়ে সাহায্য নিন।",
  },
};

// Validation Messages
export const VM = {
  birth_date: {
    required: "অনুগ্রহ করে আপনার জন্ম তারিখ নির্ধারণ করুন।",
    maxLength: "জন্ম তারিখ সঠিকভাবে দিন।",
  },
  gender: {
    required: "অনুগ্রহ করে আপনার লিঙ্গ নির্বাচন করুন।",
  },
  marital_status: {
    required: "অনুগ্রহ করে আপনার বৈবাহিক অবস্থা নির্বাচন করুন।",
  },
  height: {
    required: "অনুগ্রহ করে আপনার উচ্চতা নির্বাচন করুন।",
  },
  weight: {
    required: "অনুগ্রহ করে আপনার ওজন নির্বাচন করুন।",
  },
  complexion: {
    required: "অনুগ্রহ করে আপনার গাত্রবর্ণ নির্বাচন করুন।",
  },
  blood_group: {
    required: "অনুগ্রহ করে আপনার রক্তের গ্রুপ নির্বাচন করুন।",
  },
  location: {
    required: "অনুগ্রহ করে আপনার ঠিকানা নির্বাচন করুন।",
  },
  permanent_address: {
    required: "স্থায়ী ঠিকানা আবশ্যক।",
    maxLength: "স্থায়ী ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  education_medium: {
    required:
      "শিক্ষার মাধ্যম নির্বাচন করা আবশ্যক। দয়া করে আপনার শিক্ষার মাধ্যম নির্বাচন করুন।",
  },
  previous_exams: {
    required:
      "পূর্ববর্তী পরীক্ষা আবশ্যক। দয়া করে আপনার পূর্ববর্তী পরীক্ষার তথ্য উল্লেখ করুন।",
    minLength: "পূর্ববর্তী পরীক্ষা তথ্য সর্বনিম্ন ৫০ অক্ষর হতে হবে।",
    maxLength:
      "পূর্ববর্তী পরীক্ষা তথ্য সর্বাধিক ২৫০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  family_members_info: {
    required: "পারিবারিক সদস্যদের তথ্য আবশ্যক। দয়া করে তথ্য পূরণ করুন।",
    minLength: "পারিবারিক সদস্যদের তথ্য সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength:
      "পারিবারিক সদস্যদের তথ্য সর্বাধিক ২৫০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  economic_status: {
    required: "আর্থিক অবস্থা নির্বাচন করা আবশ্যক।",
  },
  profession: {
    required: "পেশার নাম প্রদান করা আবশ্যক।",
    minLength: "পেশার নাম সর্বনিম্ন ৫ অক্ষর হতে হবে।",
    maxLength: "পেশার নাম সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  profession_description: {
    required: "পেশার বর্ণনা প্রদান করা আবশ্যক।",
    minLength: "পেশার বর্ণনা সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength: "পেশার বর্ণনা সর্বাধিক ১৫০০ অক্ষর হতে পারবে।",
  },
  mazhab: {
    required: "মাযহাব নির্বাচন করা আবশ্যক।",
  },
  prev_marriage: {
    maxLength: "পূর্ববর্তী বিবাহ সম্পর্কিত তথ্য সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  name: {
    required: "নাম নির্বাচন করা আবশ্যক।",
    minLength: "নাম সর্বনিম্ন ২ অক্ষর হতে হবে।",
    maxLength: "নাম সর্বাধিক ২৫৫ অক্ষর হতে পারবে।",
  },
  email: {
    required: "ইমেইল ঠিকানা প্রদান করা আবশ্যক।",
    minLength: "ইমেইল ঠিকানা সর্বনিম্ন ৫ অক্ষর হতে হবে।",
    maxLength: "ইমেইল ঠিকানা সর্বাধিক ২৫৫ অক্ষর হতে পারবে।",
    email: "এই ঘরে ই-মেইল প্রদান করুন।",
  },
  hiddenLocation: {
    required: "ঠিকানা প্রদান করা আবশ্যক।",
    minLength: "ঠিকানা সর্বনিম্ন ৫ অক্ষর হতে হবে।",
    maxLength: "ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  family_members_name: {
    required: "পরিবারের সদস্যদের নাম আবশ্যক।",
    minLength: "পরিবারের সদস্যদের নাম সর্বনিম্ন ৫ অক্ষর হতে হবে।",
    maxLength: "পরিবারের সদস্যদের নাম সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  current_parent: {
    required: "বর্তমান অভিভাবকের নাম প্রদান করা আবশ্যক।",
    minLength: "বর্তমান অভিভাবকের নাম সর্বনিম্ন ২ অক্ষর হতে হবে।",
    maxLength: "বর্তমান অভিভাবকের নাম সর্বাধিক ২৫৫ অক্ষর হতে পারবে।",
  },
  parent_mobile: {
    required: "অভিভাবকের মোবাইল নম্বর প্রদান করা আবশ্যক।",
    minLength: "মোবাইল নম্বর সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength: "মোবাইল নম্বর সর্বাধিক ২৫ অক্ষর হতে পারবে।",
  },
};
