import Routes from "@/assets/data/routes";

export const Data = {
  title: "পেশা সম্পর্কিত তথ্য",
  submit: "আপডেট করুন",
  wait: "অপেক্ষা করুন...",

  success: {
    title: "পেশা সম্পর্কিত তথ্য সফলভাবে আপডেট হয়েছে",
    description:
      "আপনার পেশা সম্পর্কিত তথ্য সফলভাবে আপডেট হয়েছে। প্রয়োজন অনুযায়ী অন্য তথ্য আপডেট করুন।",
    redirectUrl: Routes.Profile,
  },
  error: {
    title: "পেশা সম্পর্কিত তথ্য আপডেট করা সম্ভব হয়নি",
    description:
      "আপনার পেশা সম্পর্কিত তথ্য আপডেট করা সম্ভব হয়নি। অনুগ্রহ করে আবার চেষ্টা করুন।",
    422: {
      title: "পেশা সম্পর্কিত তথ্য সঠিকভাবে পূর্ণ করা হয়নি",
      description:
        "আপনার পেশা সম্পর্কিত তথ্য সঠিকভাবে আপডেট করা সম্ভব হয়নি। দয়া করে যাচাই করুন এবং পুনরায় চেষ্টা করুন।",
    },
  },
  inputs: {
    profession: {
      title: "পেশা",
      triggerText: "আপনার পেশা নির্বাচন করুন",
    },
    profession_description: {
      title: "পেশার বর্ণনা",
      placeholder: "আপনার পেশার বর্ণনা দিন",
      suggestions: [
        "আপনার পেশার প্রধান দায়িত্ব ও কাজের বিবরণ প্রদান করুন।",
        "আপনার কর্মক্ষেত্র এবং কর্মস্থল সম্পর্কিত তথ্য উল্লেখ করুন।",
      ],
    },
    monthly_income: {
      title: "মাসিক আয়",
      placeholder: "আপনার মাসিক আয়ের পরিমাণ উল্লেখ করুন",
      suggestions: [
        "আপনার বর্তমান মাসিক আয়ের বিবরণ দিন।",
        "প্রয়োজনে অন্যান্য উৎস থেকে আয়ের পরিমাণ উল্লেখ করতে পারেন।",
      ],
    },
  },
  unKnownError: {
    title: "কিছু সমস্যা ঘটেছে!",
    description:
      "দয়া করে কর্তৃপক্ষের সাথে যোগাযোগ করুন এবং আপনার সমস্যার বিস্তারিত জানাবেন।",
  },
};

// Validation Messages
export const VM = {
  profession: {
    required: "পেশার নাম প্রদান করা আবশ্যক।",
    minLength: "পেশার নাম সর্বনিম্ন ৫ অক্ষর হতে হবে।",
    maxLength: "পেশার নাম সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  profession_description: {
    required: "পেশার বর্ণনা প্রদান করা আবশ্যক।",
    minLength: "পেশার বর্ণনা সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength: "পেশার বর্ণনা সর্বাধিক ১৫০০ অক্ষর হতে পারবে।",
  },
  monthly_income: {
    required: "মাসিক আয়ের তথ্য প্রদান করা আবশ্যক।",
    minLength: "মাসিক আয়ের তথ্য সর্বনিম্ন ১ অক্ষর হতে হবে।",
    maxLength: "মাসিক আয়ের তথ্য সর্বাধিক ১০০ অক্ষর হতে পারবে।",
  },
};
