<?php

namespace Database\Seeders;

use App\Models\Location;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class LocationSeeder extends Seeder
{
	/**
	 * Run the database seeds.
	 */
	public function run(): void

	// Location::factory(100)->create();
	{
		/**
		 * Locations source 'Bangladesh Gov'. 
		 * @see https://www.bangladesh.gov.bd/site/view/upazila-list/উপজেলাসমূহ
		 */
		$locations = [
			'চট্টগ্রাম' => [
				'type' => 'বিভাগ',
				'children' => [
					'কুমিল্লা' => [
						'type' => 'জেলা',
						'children' => [
							'দেবিদ্বার' => ['type' => 'উপজেলা', 'children' => []],
							'বরুড়া' => ['type' => 'উপজেলা', 'children' => []],
							'ব্রাহ্মণপাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'চান্দিনা' => ['type' => 'উপজেলা', 'children' => []],
							'চৌদ্দগ্রাম' => ['type' => 'উপজেলা', 'children' => []],
							'দাউদকান্দি' => ['type' => 'উপজেলা', 'children' => []],
							'হোমনা' => ['type' => 'উপজেলা', 'children' => []],
							'লাকসাম' => ['type' => 'উপজেলা', 'children' => []],
							'মুরাদনগর' => ['type' => 'উপজেলা', 'children' => []],
							'নাঙ্গলকোট' => ['type' => 'উপজেলা', 'children' => []],
							'কুমিল্লা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'মেঘনা' => ['type' => 'উপজেলা', 'children' => []],
							'মনোহরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'সদর দক্ষিণ' => ['type' => 'উপজেলা', 'children' => []],
							'তিতাস' => ['type' => 'উপজেলা', 'children' => []],
							'বুড়িচং' => ['type' => 'উপজেলা', 'children' => []],
							'লালমাই' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'ফেনী' => [
						'type' => 'জেলা',
						'children' => [
							'ছাগলনাইয়া' => ['type' => 'উপজেলা', 'children' => []],
							'ফেনী সদর' => ['type' => 'উপজেলা', 'children' => []],
							'সোনাগাজী' => ['type' => 'উপজেলা', 'children' => []],
							'ফুলগাজী' => ['type' => 'উপজেলা', 'children' => []],
							'পরশুরাম' => ['type' => 'উপজেলা', 'children' => []],
							'দাগনভূঞা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'ব্রাহ্মণবাড়িয়া' => [
						'type' => 'জেলা',
						'children' => [
							'ব্রাহ্মণবাড়িয়া সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কসবা' => ['type' => 'উপজেলা', 'children' => []],
							'নাসিরনগর' => ['type' => 'উপজেলা', 'children' => []],
							'সরাইল' => ['type' => 'উপজেলা', 'children' => []],
							'আশুগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'আখাউড়া' => ['type' => 'উপজেলা', 'children' => []],
							'নবীনগর' => ['type' => 'উপজেলা', 'children' => []],
							'বাঞ্ছারামপুর' => ['type' => 'উপজেলা', 'children' => []],
							'বিজয়নগর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'রাঙ্গামাটি' => [
						'type' => 'জেলা',
						'children' => [
							'রাঙ্গামাটি সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কাপ্তাই' => ['type' => 'উপজেলা', 'children' => []],
							'কাউখালী' => ['type' => 'উপজেলা', 'children' => []],
							'বাঘাইছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'বরকল' => ['type' => 'উপজেলা', 'children' => []],
							'লংগদু' => ['type' => 'উপজেলা', 'children' => []],
							'রাজস্থলী' => ['type' => 'উপজেলা', 'children' => []],
							'বিলাইছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'জুরাছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'নানিয়ারচর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'নোয়াখালী' => [
						'type' => 'জেলা',
						'children' => [
							'নোয়াখালী' => ['type' => 'উপজেলা', 'children' => []],
							'কোম্পানীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বেগমগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'হাতিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'সুবর্ণচর' => ['type' => 'উপজেলা', 'children' => []],
							'কবিরহাট' => ['type' => 'উপজেলা', 'children' => []],
							'সেনবাগ' => ['type' => 'উপজেলা', 'children' => []],
							'চাটখিল' => ['type' => 'উপজেলা', 'children' => []],
							'সোনাইমুড়ী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'চাঁদপুর' => [
						'type' => 'জেলা',
						'children' => [
							'হাইমচর' => ['type' => 'উপজেলা', 'children' => []],
							'কচুয়া' => ['type' => 'উপজেলা', 'children' => []],
							'শাহরাস্তি' => ['type' => 'উপজেলা', 'children' => []],
							'চাঁদপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'মতলব' => ['type' => 'উপজেলা', 'children' => []],
							'হাজীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							// 'মতলব' => ['type' => 'উপজেলা', 'children' => []],
							'ফরিদগঞ্জ' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'লক্ষ্মীপুর' => [
						'type' => 'জেলা',
						'children' => [
							'লক্ষ্মীপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কমলনগর' => ['type' => 'উপজেলা', 'children' => []],
							'রায়পুর' => ['type' => 'উপজেলা', 'children' => []],
							'রামগতি' => ['type' => 'উপজেলা', 'children' => []],
							'রামগঞ্জ' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'চট্টগ্রাম' => [
						'type' => 'জেলা',
						'children' => [
							'রাঙ্গুনিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'সীতাকুন্ড' => ['type' => 'উপজেলা', 'children' => []],
							'মীরসরাই' => ['type' => 'উপজেলা', 'children' => []],
							'পটিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'সন্দ্বীপ' => ['type' => 'উপজেলা', 'children' => []],
							'বাঁশখালী' => ['type' => 'উপজেলা', 'children' => []],
							'বোয়ালখালী' => ['type' => 'উপজেলা', 'children' => []],
							'আনোয়ারা' => ['type' => 'উপজেলা', 'children' => []],
							'চন্দনাইশ' => ['type' => 'উপজেলা', 'children' => []],
							'সাতকানিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'লোহাগাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'হাটহাজারী' => ['type' => 'উপজেলা', 'children' => []],
							'ফটিকছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'রাউজান' => ['type' => 'উপজেলা', 'children' => []],
							'চট্টগ্রাম সদর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'কক্সবাজার' => [
						'type' => 'জেলা',
						'children' => [
							'কক্সবাজার সদর' => ['type' => 'উপজেলা', 'children' => []],
							'মহেশখালী' => ['type' => 'উপজেলা', 'children' => []],
							'কুতুবদিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'চকরিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'পেকুয়া' => ['type' => 'উপজেলা', 'children' => []],
							'রামু' => ['type' => 'উপজেলা', 'children' => []],
							'টেকনাফ' => ['type' => 'উপজেলা', 'children' => []],
							'উখিয়া' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'খাগড়াছড়ি' => [
						'type' => 'জেলা',
						'children' => [
							'মহালছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'মানিকছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'পানছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'লক্ষীছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'দিঘীনালা' => ['type' => 'উপজেলা', 'children' => []],
							'মাটিরাঙ্গা' => ['type' => 'উপজেলা', 'children' => []],
							'রামগড়' => ['type' => 'উপজেলা', 'children' => []],
							'খাগড়াছড়ি সদর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'বান্দরবান' => [
						'type' => 'জেলা',
						'children' => [
							'বান্দরবান সদর' => ['type' => 'উপজেলা', 'children' => []],
							'আলীকদম' => ['type' => 'উপজেলা', 'children' => []],
							'থানচি' => ['type' => 'উপজেলা', 'children' => []],
							'লামা' => ['type' => 'উপজেলা', 'children' => []],
							'রুমা' => ['type' => 'উপজেলা', 'children' => []],
							'রোয়াংছড়ি' => ['type' => 'উপজেলা', 'children' => []],
							'নাইক্ষ্যংছড়ি' => ['type' => 'উপজেলা', 'children' => []]
						]
					]
				]
			],
			'রাজশাহী' => [
				'type' => 'বিভাগ',
				'children' => [
					'সিরাজগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'বেলকুচি' => ['type' => 'উপজেলা', 'children' => []],
							'চৌহালি' => ['type' => 'উপজেলা', 'children' => []],
							'কামারখন্দ' => ['type' => 'উপজেলা', 'children' => []],
							'কাজীপুর' => ['type' => 'উপজেলা', 'children' => []],
							'রায়গঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'শাহজাদপুর' => ['type' => 'উপজেলা', 'children' => []],
							'সিরাজগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'তাড়াশ' => ['type' => 'উপজেলা', 'children' => []],
							'উল্লাপাড়া' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'পাবনা' => [
						'type' => 'জেলা',
						'children' => [
							'সুজানগর' => ['type' => 'উপজেলা', 'children' => []],
							'ঈশ্বরদী' => ['type' => 'উপজেলা', 'children' => []],
							'ভাঙ্গুড়া' => ['type' => 'উপজেলা', 'children' => []],
							'পাবনা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'বেড়া' => ['type' => 'উপজেলা', 'children' => []],
							'আটঘরিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'চাটমোহর' => ['type' => 'উপজেলা', 'children' => []],
							'সাঁথিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'ফরিদপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'বগুড়া' => [
						'type' => 'জেলা',
						'children' => [
							'কাহালু' => ['type' => 'উপজেলা', 'children' => []],
							'বগুড়া সদর' => ['type' => 'উপজেলা', 'children' => []],
							'সারিয়াকান্দি' => ['type' => 'উপজেলা', 'children' => []],
							'শাজাহানপুর' => ['type' => 'উপজেলা', 'children' => []],
							'দুপচাচিঁয়া' => ['type' => 'উপজেলা', 'children' => []],
							'আদমদিঘি' => ['type' => 'উপজেলা', 'children' => []],
							'নন্দিগ্রাম' => ['type' => 'উপজেলা', 'children' => []],
							'সোনাতলা' => ['type' => 'উপজেলা', 'children' => []],
							'ধুনট' => ['type' => 'উপজেলা', 'children' => []],
							'গাবতলী' => ['type' => 'উপজেলা', 'children' => []],
							'শেরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'শিবগঞ্জ' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'রাজশাহী' => [
						'type' => 'জেলা',
						'children' => [
							'পবা' => ['type' => 'উপজেলা', 'children' => []],
							'দুর্গাপুর' => ['type' => 'উপজেলা', 'children' => []],
							'মোহনপুর' => ['type' => 'উপজেলা', 'children' => []],
							'চারঘাট' => ['type' => 'উপজেলা', 'children' => []],
							'পুঠিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'বাঘা' => ['type' => 'উপজেলা', 'children' => []],
							'গোদাগাড়ী' => ['type' => 'উপজেলা', 'children' => []],
							'তানোর' => ['type' => 'উপজেলা', 'children' => []],
							'বাগমারা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'নাটোর' => [
						'type' => 'জেলা',
						'children' => [
							'নাটোর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'সিংড়া' => ['type' => 'উপজেলা', 'children' => []],
							'বড়াইগ্রাম' => ['type' => 'উপজেলা', 'children' => []],
							'বাগাতিপাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'লালপুর' => ['type' => 'উপজেলা', 'children' => []],
							'গুরুদাসপুর' => ['type' => 'উপজেলা', 'children' => []],
							'নলডাঙ্গা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'জয়পুরহাট' => [
						'type' => 'জেলা',
						'children' => [
							'আক্কেলপুর' => ['type' => 'উপজেলা', 'children' => []],
							'কালাই' => ['type' => 'উপজেলা', 'children' => []],
							'ক্ষেতলাল' => ['type' => 'উপজেলা', 'children' => []],
							'পাঁচবিবি' => ['type' => 'উপজেলা', 'children' => []],
							'জয়পুরহাট' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'চাঁপাইনবাবগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'চাঁপাইনবাবগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'গোমস্তাপুর' => ['type' => 'উপজেলা', 'children' => []],
							'নাচোল' => ['type' => 'উপজেলা', 'children' => []],
							'ভোলাহাট' => ['type' => 'উপজেলা', 'children' => []],
							'শিবগঞ্জ' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'নওগাঁ' => [
						'type' => 'জেলা',
						'children' => [
							'মহাদেবপুর' => ['type' => 'উপজেলা', 'children' => []],
							'বদলগাছী' => ['type' => 'উপজেলা', 'children' => []],
							'পত্নিতলা' => ['type' => 'উপজেলা', 'children' => []],
							'ধামইরহাট' => ['type' => 'উপজেলা', 'children' => []],
							'নিয়ামতপুর' => ['type' => 'উপজেলা', 'children' => []],
							'মান্দা' => ['type' => 'উপজেলা', 'children' => []],
							'আত্রাই' => ['type' => 'উপজেলা', 'children' => []],
							'রাণীনগর' => ['type' => 'উপজেলা', 'children' => []],
							'নওগাঁ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'পোরশা' => ['type' => 'উপজেলা', 'children' => []],
							'সাপাহার' => ['type' => 'উপজেলা', 'children' => []]
						]
					]
				]
			],
			'খুলনা' => [
				'type' => 'বিভাগ',
				'children' => [
					'যশোর' => [
						'type' => 'জেলা',
						'children' => [
							'মণিরামপুর' => ['type' => 'উপজেলা', 'children' => []],
							'অভয়নগর' => ['type' => 'উপজেলা', 'children' => []],
							'বাঘারপাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'চৌগাছা' => ['type' => 'উপজেলা', 'children' => []],
							'ঝিকরগাছা' => ['type' => 'উপজেলা', 'children' => []],
							'কেশবপুর' => ['type' => 'উপজেলা', 'children' => []],
							'যশোর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'শার্শা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'সাতক্ষীরা' => [
						'type' => 'জেলা',
						'children' => [
							'আশাশুনি' => ['type' => 'উপজেলা', 'children' => []],
							'দেবহাটা' => ['type' => 'উপজেলা', 'children' => []],
							'কলারোয়া' => ['type' => 'উপজেলা', 'children' => []],
							'সাতক্ষীরা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'শ্যামনগর' => ['type' => 'উপজেলা', 'children' => []],
							'তালা' => ['type' => 'উপজেলা', 'children' => []],
							'কালিগঞ্জ' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'মেহেরপুর' => [
						'type' => 'জেলা',
						'children' => [
							'মুজিবনগর' => ['type' => 'উপজেলা', 'children' => []],
							'মেহেরপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'গাংনী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'নড়াইল' => [
						'type' => 'জেলা',
						'children' => [
							'নড়াইল সদর' => ['type' => 'উপজেলা', 'children' => []],
							'লোহাগড়া' => ['type' => 'উপজেলা', 'children' => []],
							'কালিয়া' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'চুয়াডাঙ্গা' => [
						'type' => 'জেলা',
						'children' => [
							'চুয়াডাঙ্গা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'আলমডাঙ্গা' => ['type' => 'উপজেলা', 'children' => []],
							'দামুড়হুদা' => ['type' => 'উপজেলা', 'children' => []],
							'জীবননগর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'কুষ্টিয়া' => [
						'type' => 'জেলা',
						'children' => [
							'কুষ্টিয়া সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কুমারখালী' => ['type' => 'উপজেলা', 'children' => []],
							'খোকসা' => ['type' => 'উপজেলা', 'children' => []],
							'মিরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'দৌলতপুর' => ['type' => 'উপজেলা', 'children' => []],
							'ভেড়ামারা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'মাগুরা' => [
						'type' => 'জেলা',
						'children' => [
							'শালিখা' => ['type' => 'উপজেলা', 'children' => []],
							'শ্রীপুর' => ['type' => 'উপজেলা', 'children' => []],
							'মাগুরা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'মহম্মদপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'খুলনা' => [
						'type' => 'জেলা',
						'children' => [
							'পাইকগাছা' => ['type' => 'উপজেলা', 'children' => []],
							'ফুলতলা' => ['type' => 'উপজেলা', 'children' => []],
							'দিঘলিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'রূপসা' => ['type' => 'উপজেলা', 'children' => []],
							'তেরখাদা' => ['type' => 'উপজেলা', 'children' => []],
							'ডুমুরিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'বটিয়াঘাটা' => ['type' => 'উপজেলা', 'children' => []],
							'দাকোপ' => ['type' => 'উপজেলা', 'children' => []],
							'কয়রা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'বাগেরহাট' => [
						'type' => 'জেলা',
						'children' => [
							'ফকিরহাট' => ['type' => 'উপজেলা', 'children' => []],
							'বাগেরহাট সদর' => ['type' => 'উপজেলা', 'children' => []],
							'মোল্লাহাট' => ['type' => 'উপজেলা', 'children' => []],
							'শরণখোলা' => ['type' => 'উপজেলা', 'children' => []],
							'রামপাল' => ['type' => 'উপজেলা', 'children' => []],
							'মোড়েলগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'কচুয়া' => ['type' => 'উপজেলা', 'children' => []],
							'মোংলা' => ['type' => 'উপজেলা', 'children' => []],
							'চিতলমারী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'ঝিনাইদহ' => [
						'type' => 'জেলা',
						'children' => [
							'ঝিনাইদহ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'শৈলকুপা' => ['type' => 'উপজেলা', 'children' => []],
							'হরিণাকুন্ডু' => ['type' => 'উপজেলা', 'children' => []],
							'কালীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'কোটচাঁদপুর' => ['type' => 'উপজেলা', 'children' => []],
							'মহেশপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					]
				]
			],
			'বরিশাল' => [
				'type' => 'বিভাগ',
				'children' => [
					'ঝালকাঠি' => [
						'type' => 'জেলা',
						'children' => [
							'ঝালকাঠি সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কাঠালিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'নলছিটি' => ['type' => 'উপজেলা', 'children' => []],
							'রাজাপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'পটুয়াখালী' => [
						'type' => 'জেলা',
						'children' => [
							'বাউফল' => ['type' => 'উপজেলা', 'children' => []],
							'পটুয়াখালী সদর' => ['type' => 'উপজেলা', 'children' => []],
							'দুমকি' => ['type' => 'উপজেলা', 'children' => []],
							'দশমিনা' => ['type' => 'উপজেলা', 'children' => []],
							'কলাপাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'মির্জাগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'গলাচিপা' => ['type' => 'উপজেলা', 'children' => []],
							'রাঙ্গাবালী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'পিরোজপুর' => [
						'type' => 'জেলা',
						'children' => [
							'পিরোজপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'নাজিরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'কাউখালী' => ['type' => 'উপজেলা', 'children' => []],
							'ভান্ডারিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'মঠবাড়ীয়া' => ['type' => 'উপজেলা', 'children' => []],
							'নেছারাবাদ' => ['type' => 'উপজেলা', 'children' => []],
							'ইন্দুরকানী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'বরিশাল' => [
						'type' => 'জেলা',
						'children' => [
							'বরিশাল সদর' => ['type' => 'উপজেলা', 'children' => []],
							'বাকেরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বাবুগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'উজিরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'বানারীপাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'গৌরনদী' => ['type' => 'উপজেলা', 'children' => []],
							'আগৈলঝাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'মেহেন্দিগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'মুলাদী' => ['type' => 'উপজেলা', 'children' => []],
							'হিজলা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'ভোলা' => [
						'type' => 'জেলা',
						'children' => [
							'ভোলা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'বোরহান উদ্দিন' => ['type' => 'উপজেলা', 'children' => []],
							'চরফ্যাশন' => ['type' => 'উপজেলা', 'children' => []],
							'দৌলতখান' => ['type' => 'উপজেলা', 'children' => []],
							'মনপুরা' => ['type' => 'উপজেলা', 'children' => []],
							'তজুমদ্দিন' => ['type' => 'উপজেলা', 'children' => []],
							'লালমোহন' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'বরগুনা' => [
						'type' => 'জেলা',
						'children' => [
							'আমতলী' => ['type' => 'উপজেলা', 'children' => []],
							'বরগুনা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'বেতাগী' => ['type' => 'উপজেলা', 'children' => []],
							'বামনা' => ['type' => 'উপজেলা', 'children' => []],
							'পাথরঘাটা' => ['type' => 'উপজেলা', 'children' => []],
							'তালতলি' => ['type' => 'উপজেলা', 'children' => []]
						]
					]
				]
			],
			'সিলেট' => [
				'type' => 'বিভাগ',
				'children' => [
					'সিলেট' => [
						'type' => 'জেলা',
						'children' => [
							'বালাগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বিয়ানীবাজার' => ['type' => 'উপজেলা', 'children' => []],
							'বিশ্বনাথ' => ['type' => 'উপজেলা', 'children' => []],
							'কোম্পানীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'ফেঞ্চুগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'গোলাপগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'গোয়াইনঘাট' => ['type' => 'উপজেলা', 'children' => []],
							'জৈন্তাপুর' => ['type' => 'উপজেলা', 'children' => []],
							'কানাইঘাট' => ['type' => 'উপজেলা', 'children' => []],
							'সিলেট সদর' => ['type' => 'উপজেলা', 'children' => []],
							'জকিগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'দক্ষিণ সুরমা' => ['type' => 'উপজেলা', 'children' => []],
							'ওসমানী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'মৌলভীবাজার' => [
						'type' => 'জেলা',
						'children' => [
							'বড়লেখা' => ['type' => 'উপজেলা', 'children' => []],
							'কমলগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'কুলাউড়া' => ['type' => 'উপজেলা', 'children' => []],
							'মৌলভীবাজার সদর' => ['type' => 'উপজেলা', 'children' => []],
							'রাজনগর' => ['type' => 'উপজেলা', 'children' => []],
							'শ্রীমঙ্গল' => ['type' => 'উপজেলা', 'children' => []],
							'জুড়ী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'হবিগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'নবীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বাহুবল' => ['type' => 'উপজেলা', 'children' => []],
							'আজমিরীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বানিয়াচং' => ['type' => 'উপজেলা', 'children' => []],
							'লাখাই' => ['type' => 'উপজেলা', 'children' => []],
							'চুনারুঘাট' => ['type' => 'উপজেলা', 'children' => []],
							'হবিগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'মাধবপুর' => ['type' => 'উপজেলা', 'children' => []],
							'শায়েস্তাগঞ্জ' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'সুনামগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'সুনামগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'দক্ষিণ সুনামগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বিশ্বম্ভরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'ছাতক' => ['type' => 'উপজেলা', 'children' => []],
							'জগন্নাথপুর' => ['type' => 'উপজেলা', 'children' => []],
							'দোয়ারাবাজার' => ['type' => 'উপজেলা', 'children' => []],
							'তাহিরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'ধর্মপাশা' => ['type' => 'উপজেলা', 'children' => []],
							'জামালগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'শাল্লা' => ['type' => 'উপজেলা', 'children' => []],
							'দিরাই' => ['type' => 'উপজেলা', 'children' => []],
							'মধ্যনগর' => ['type' => 'উপজেলা', 'children' => []]
						]
					]
				]
			],
			'ঢাকা' => [
				'type' => 'বিভাগ',
				'children' => [
					'নরসিংদী' => [
						'type' => 'জেলা',
						'children' => [
							'বেলাবো' => ['type' => 'উপজেলা', 'children' => []],
							'মনোহরদী' => ['type' => 'উপজেলা', 'children' => []],
							'নরসিংদী' => ['type' => 'উপজেলা', 'children' => []],
							'পলাশ' => ['type' => 'উপজেলা', 'children' => []],
							'রায়পুরা' => ['type' => 'উপজেলা', 'children' => []],
							'শিবপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'গাজীপুর' => [
						'type' => 'জেলা',
						'children' => [
							'কালীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'কালিয়াকৈর' => ['type' => 'উপজেলা', 'children' => []],
							'কাপাসিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'গাজীপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'শ্রীপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'শরীয়তপুর' => [
						'type' => 'জেলা',
						'children' => [
							'শরিয়তপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'নড়িয়া' => ['type' => 'উপজেলা', 'children' => []],
							'জাজিরা' => ['type' => 'উপজেলা', 'children' => []],
							'গোসাইরহাট' => ['type' => 'উপজেলা', 'children' => []],
							'ভেদরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'ডামুড্যা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'নারায়ণগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'আড়াইহাজার' => ['type' => 'উপজেলা', 'children' => []],
							'বন্দর' => ['type' => 'উপজেলা', 'children' => []],
							'নারায়নগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'রূপগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'সোনারগাঁ' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'টাঙ্গাইল' => [
						'type' => 'জেলা',
						'children' => [
							'বাসাইল' => ['type' => 'উপজেলা', 'children' => []],
							'ভুয়াপুর' => ['type' => 'উপজেলা', 'children' => []],
							'দেলদুয়ার' => ['type' => 'উপজেলা', 'children' => []],
							'ঘাটাইল' => ['type' => 'উপজেলা', 'children' => []],
							'গোপালপুর' => ['type' => 'উপজেলা', 'children' => []],
							'মধুপুর' => ['type' => 'উপজেলা', 'children' => []],
							'মির্জাপুর' => ['type' => 'উপজেলা', 'children' => []],
							'নাগরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'সখিপুর' => ['type' => 'উপজেলা', 'children' => []],
							'টাঙ্গাইল সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কালিহাতী' => ['type' => 'উপজেলা', 'children' => []],
							'ধনবাড়ী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'কিশোরগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'ইটনা' => ['type' => 'উপজেলা', 'children' => []],
							'কটিয়াদী' => ['type' => 'উপজেলা', 'children' => []],
							'ভৈরব' => ['type' => 'উপজেলা', 'children' => []],
							'তাড়াইল' => ['type' => 'উপজেলা', 'children' => []],
							'হোসেনপুর' => ['type' => 'উপজেলা', 'children' => []],
							'পাকুন্দিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'কুলিয়ারচর' => ['type' => 'উপজেলা', 'children' => []],
							'কিশোরগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'করিমগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বাজিতপুর' => ['type' => 'উপজেলা', 'children' => []],
							'অষ্টগ্রাম' => ['type' => 'উপজেলা', 'children' => []],
							'মিঠামইন' => ['type' => 'উপজেলা', 'children' => []],
							'নিকলী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'মানিকগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'হরিরামপুর' => ['type' => 'উপজেলা', 'children' => []],
							'সাটুরিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'মানিকগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'ঘিওর' => ['type' => 'উপজেলা', 'children' => []],
							'শিবালয়' => ['type' => 'উপজেলা', 'children' => []],
							'দৌলতপুর' => ['type' => 'উপজেলা', 'children' => []],
							'সিংগাইর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'ঢাকা' => [
						'type' => 'জেলা',
						'children' => [
							'সাভার' => ['type' => 'উপজেলা', 'children' => []],
							'ধামরাই' => ['type' => 'উপজেলা', 'children' => []],
							'কেরাণীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'নবাবগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'দোহার' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'মুন্সিগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'মুন্সিগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'শ্রীনগর' => ['type' => 'উপজেলা', 'children' => []],
							'সিরাজদিখান' => ['type' => 'উপজেলা', 'children' => []],
							'লৌহজং' => ['type' => 'উপজেলা', 'children' => []],
							'গজারিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'টংগীবাড়ি' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'রাজবাড়ী' => [
						'type' => 'জেলা',
						'children' => [
							'রাজবাড়ী সদর' => ['type' => 'উপজেলা', 'children' => []],
							'গোয়ালন্দ' => ['type' => 'উপজেলা', 'children' => []],
							'পাংশা' => ['type' => 'উপজেলা', 'children' => []],
							'বালিয়াকান্দি' => ['type' => 'উপজেলা', 'children' => []],
							'কালুখালী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'মাদারীপুর' => [
						'type' => 'জেলা',
						'children' => [
							'মাদারীপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'শিবচর' => ['type' => 'উপজেলা', 'children' => []],
							'কালকিনি' => ['type' => 'উপজেলা', 'children' => []],
							'রাজৈর' => ['type' => 'উপজেলা', 'children' => []],
							'ডাসার' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'গোপালগঞ্জ' => [
						'type' => 'জেলা',
						'children' => [
							'গোপালগঞ্জ সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কাশিয়ানী' => ['type' => 'উপজেলা', 'children' => []],
							'টুংগীপাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'কোটালীপাড়া' => ['type' => 'উপজেলা', 'children' => []],
							'মুকসুদপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'ফরিদপুর' => [
						'type' => 'জেলা',
						'children' => [
							'ফরিদপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'আলফাডাঙ্গা' => ['type' => 'উপজেলা', 'children' => []],
							'বোয়ালমারী' => ['type' => 'উপজেলা', 'children' => []],
							'সদরপুর' => ['type' => 'উপজেলা', 'children' => []],
							'নগরকান্দা' => ['type' => 'উপজেলা', 'children' => []],
							'ভাঙ্গা' => ['type' => 'উপজেলা', 'children' => []],
							'চরভদ্রাসন' => ['type' => 'উপজেলা', 'children' => []],
							'মধুখালী' => ['type' => 'উপজেলা', 'children' => []],
							'সালথা' => ['type' => 'উপজেলা', 'children' => []]
						]
					]
				]
			],
			'রংপুর' => [
				'type' => 'বিভাগ',
				'children' => [
					'পঞ্চগড়' => [
						'type' => 'জেলা',
						'children' => [
							'পঞ্চগড়' => ['type' => 'উপজেলা', 'children' => []],
							'দেবীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বোদা' => ['type' => 'উপজেলা', 'children' => []],
							'আটোয়ারী' => ['type' => 'উপজেলা', 'children' => []],
							'তেতুলিয়া' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'দিনাজপুর' => [
						'type' => 'জেলা',
						'children' => [
							'নবাবগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বীরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'ঘোড়াঘাট' => ['type' => 'উপজেলা', 'children' => []],
							'বিরামপুর' => ['type' => 'উপজেলা', 'children' => []],
							'পার্বতীপুর' => ['type' => 'উপজেলা', 'children' => []],
							'বোচাগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'কাহারোল' => ['type' => 'উপজেলা', 'children' => []],
							'ফুলবাড়ী' => ['type' => 'উপজেলা', 'children' => []],
							'দিনাজপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'হাকিমপুর' => ['type' => 'উপজেলা', 'children' => []],
							'খানসামা' => ['type' => 'উপজেলা', 'children' => []],
							'বিরল' => ['type' => 'উপজেলা', 'children' => []],
							'চিরিরবন্দর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'লালমনিরহাট' => [
						'type' => 'জেলা',
						'children' => [
							'লালমনিরহাট সদর' => ['type' => 'উপজেলা', 'children' => []],
							'কালীগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'হাতীবান্ধা' => ['type' => 'উপজেলা', 'children' => []],
							'পাটগ্রাম' => ['type' => 'উপজেলা', 'children' => []],
							'আদিতমারী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'নীলফামারী' => [
						'type' => 'জেলা',
						'children' => [
							'সৈয়দপুর' => ['type' => 'উপজেলা', 'children' => []],
							'ডোমার' => ['type' => 'উপজেলা', 'children' => []],
							'ডিমলা' => ['type' => 'উপজেলা', 'children' => []],
							'জলঢাকা' => ['type' => 'উপজেলা', 'children' => []],
							'কিশোরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'নীলফামারী সদর' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'গাইবান্ধা' => [
						'type' => 'জেলা',
						'children' => [
							'সাদুল্লাপুর' => ['type' => 'উপজেলা', 'children' => []],
							'গাইবান্ধা সদর' => ['type' => 'উপজেলা', 'children' => []],
							'পলাশবাড়ী' => ['type' => 'উপজেলা', 'children' => []],
							'সাঘাটা' => ['type' => 'উপজেলা', 'children' => []],
							'গোবিন্দগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'সুন্দরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'ফুলছড়ি' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'ঠাকুরগাঁও' => [
						'type' => 'জেলা',
						'children' => [
							'ঠাকুরগাঁও সদর' => ['type' => 'উপজেলা', 'children' => []],
							'পীরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'রাণীশংকৈল' => ['type' => 'উপজেলা', 'children' => []],
							'হরিপুর' => ['type' => 'উপজেলা', 'children' => []],
							'বালিয়াডাঙ্গী' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'রংপুর' => [
						'type' => 'জেলা',
						'children' => [
							'রংপুর সদর' => ['type' => 'উপজেলা', 'children' => []],
							'গংগাচড়া' => ['type' => 'উপজেলা', 'children' => []],
							'তারাগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'বদরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'মিঠাপুকুর' => ['type' => 'উপজেলা', 'children' => []],
							'পীরগঞ্জ' => ['type' => 'উপজেলা', 'children' => []],
							'কাউনিয়া' => ['type' => 'উপজেলা', 'children' => []],
							'পীরগাছা' => ['type' => 'উপজেলা', 'children' => []]
						]
					],
					'কুড়িগ্রাম' => [
						'type' => 'জেলা',
						'children' => [
							'কুড়িগ্রাম সদর' => ['type' => 'উপজেলা', 'children' => []],
							'নাগেশ্বরী' => ['type' => 'উপজেলা', 'children' => []],
							'ভুরুঙ্গামারী' => ['type' => 'উপজেলা', 'children' => []],
							'ফুলবাড়ী' => ['type' => 'উপজেলা', 'children' => []],
							'রাজারহাট' => ['type' => 'উপজেলা', 'children' => []],
							'উলিপুর' => ['type' => 'উপজেলা', 'children' => []],
							'চিলমারী' => ['type' => 'উপজেলা', 'children' => []],
							'রৌমারী' => ['type' => 'উপজেলা', 'children' => []],
							'চর রাজিবপুর' => ['type' => 'উপজেলা', 'children' => []]
						]
					]
				]
			]
			// Add other divisions here
		];

		// Call the recursive function to seed data
		$this->seedLocations($locations);
	}

	/**
	 * Recursive function to seed locations.
	 *
	 * @param array $locations
	 * @param int|null $parentId
	 */
	private function seedLocations(array $locations, $parentId = null)
	{
		foreach ($locations as $name => $location) {
			$newLocation = Location::create([
				'name' => trim($name),
				'location_type' => 	trim($location['type']),
				'parent_id' => $parentId,
			]);

			if (!empty($location['children'])) {
				$this->seedLocations($location['children'], $newLocation->id);
			}
		}
	}
}
