import Routes from "@/assets/data/routes";

export const Data = {
  title: "ব্যক্তিগত তথ্য আপডেট",
  submit: "আপডেট করুন",
  wait: "অপেক্ষা করুন...",

  success: {
    title: "ব্যক্তিগত তথ্য সফলভাবে আপডেট হয়েছে",
    description:
      "আপনার ব্যক্তিগত তথ্য সফলভাবে আপডেট হয়েছে। প্রয়োজন অনুযায়ী অন্য তথ্য আপডেট করুন।",
    redirectUrl: Routes.Profile,
  },
  error: {
    title: "ব্যক্তিগত তথ্য আপডেট করা সম্ভব হয়নি",
    description:
      "আপনার ব্যক্তিগত তথ্য আপডেট করা সম্ভব হয়নি। অনুগ্রহ করে আবার চেষ্টা করুন।",
    tryAgainDescription: "দয়া করে সংশোধনী মেনে পুনরায় চেষ্টা করুন।",
    422: {
      title: "ব্যক্তিগত তথ্য সঠিকভাবে পূরণ করা হয়নি",
      description:
        "আপনার ব্যক্তিগত তথ্য সঠিকভাবে আপডেট করা সম্ভব হয়নি। দয়া করে যাচাই করুন এবং পুনরায় চেষ্টা করুন।",
    },
  },
  inputs: {
    about_yourself: {
      title: "নিজের সম্পর্কে",
      placeholder: "আপনার সম্পর্কে কিছু লিখুন",
      suggestions: [
        "আপনার পছন্দ, শখ, এবং অন্যান্য গুরুত্বপূর্ণ তথ্য উল্লেখ করুন।",
        "আপনার ভবিষ্যত পরিকল্পনা বা লক্ষ্যও উল্লেখ করতে পারেন।",
      ],
    },
    outdoor_clothing: {
      title: "বাহিরে পরিধান করা পোশাকের ধরন",
      placeholder: "আপনি বাহিরে কোন ধরনের পোশাক পরিধান করেন?",
      suggestions: [
        "আপনি এই ধরনের পোশাক পরিধান করা শুরু করেছেন কবে থেকে?",
        "আপনার পূর্বে ব্যবহৃত পোশাকের ধরন উল্লেখ করুন।",
      ],
    },
    physical_mental_illness: {
      title: "শারীরিক/মানসিক অসুস্থতা",
      placeholder: "যদি থাকে, আপনার শারীরিক বা মানসিক অসুস্থতা উল্লেখ করুন",
      suggestions: [
        "আপনার শারীরিক বা মানসিক স্বাস্থ্য সম্পর্কিত তথ্য দিন।",
        "যদি কোনও চিকিৎসা চলছে, তা উল্লেখ করুন।",
      ],
    },
    favorite_books: {
      title: "প্রিয় বই",
      placeholder: "আপনার প্রিয় বইগুলোর তালিকা প্রদান করুন",
      suggestions: [
        "আপনার প্রিয় বই এবং লেখকদের নাম উল্লেখ করুন।",
        "বইয়ের ধরণ উল্লেখ করুন, যেমন: কাল্পনিক, আত্মজীবনী, শিক্ষামূলক ইত্যাদি।",
      ],
    },
    favorite_online_personalities: {
      title: "প্রিয় অনলাইন ব্যক্তিত্ব",
      placeholder: "আপনার প্রিয় অনলাইন ব্যক্তিত্ব উল্লেখ করুন",
      suggestions: [
        "আপনার প্রিয় আলেম, ইউটিউবার, ব্লগার, বা সোশ্যাল মিডিয়া ইনফ্লুয়েন্সারদের উল্লেখ করুন।",
      ],
    },
    device_usage_time: {
      title: "মোবাইল ও কম্পিউটার ব্যবহারের সময়",
      placeholder: "আপনার দৈনিক মোবাইল ও কম্পিউটার ব্যবহারের সময় উল্লেখ করুন",
      suggestions: [
        "প্রতিদিন কত ঘণ্টা আপনি মোবাইল বা কম্পিউটার ব্যবহার করেন?",
        "আপনার মোবাইল এবং কম্পিউটার ব্যবহারের উদ্দেশ্য বা প্রয়োজনগুলি উল্লেখ করুন।",
      ],
    },

    affiliations: {
      title:
        "আপনার বা আপনার পরিবারের কোন দল, মত, বা কর্মকান্ডের সাথে যুক্ত থাকার বিষয়টি উল্লেখ করুন।",
      placeholder:
        "দাওয়াত ও তাবলিগের কর্মকান্ডের সাথে যুক্ত থাকা, জাতীয়তাবাদী দল (বিএনপি)-এর সাথে সম্পৃক্ততা ইত্যাদি উল্লেখ করুন।",
      suggestions: [
        "আপনার কাজ বা ব্যক্তিগত জীবনের সাথে সম্পর্কিত সংস্থাগুলোর নাম উল্লেখ করুন।",
        "আপনার বা আপনার পরিবারের যেকোনো সদস্যপদ, সংগঠন, বা কর্মকান্ডের সাথে যুক্ত থাকার তথ্য বিস্তারিতভাবে উল্লেখ করুন।",
      ],
    },
  },
  unKnownError: {
    title: "কিছু সমস্যা ঘটেছে!",
    description:
      "দয়া করে কর্তৃপক্ষের সাথে যোগাযোগ করুন এবং আপনার সমস্যার বিস্তারিত জানাবেন।",
  },
};

// Validation Message
export const VM = {
  about_yourself: {
    required: "নিজের সম্পর্কে তথ্য আবশ্যক। দয়া করে আপনার সম্পর্কে লিখুন।",
    minLength: "নিজের সম্পর্কে তথ্য সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength:
      "নিজের সম্পর্কে তথ্য সর্বাধিক ২৫০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  outdoor_clothing: {
    required:
      "বহিরঙ্গন পোশাক তথ্য আবশ্যক। দয়া করে আপনার পোশাকের অভ্যাস উল্লেখ করুন।",
    minLength: "বহিরঙ্গন পোশাক তথ্য সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength:
      "বহিরঙ্গন পোশাক তথ্য সর্বাধিক ১০০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  physical_mental_illness: {
    required:
      "শারীরিক/মানসিক অসুস্থতা তথ্য আবশ্যক। দয়া করে আপনার স্বাস্থ্য সম্পর্কিত তথ্য উল্লেখ করুন।",
    minLength: "শারীরিক/মানসিক অসুস্থতা তথ্য সর্বনিম্ন ১০ অক্ষর হতে হবে।",
    maxLength:
      "শারীরিক/মানসিক অসুস্থতা তথ্য সর্বাধিক ১০০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  favorite_books: {
    maxLength:
      "প্রিয় বই তথ্য সর্বাধিক ১০০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  favorite_online_personalities: {
    maxLength:
      "প্রিয় অনলাইন ব্যক্তিত্ব তথ্য সর্বাধিক ১০০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  device_usage_time: {
    maxLength:
      "যন্ত্র ব্যবহারের সময় সর্বাধিক ১০০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
  affiliations: {
    maxLength:
      "সংযুক্তি তথ্য সর্বাধিক ১০০০ অক্ষর হতে পারবে। দয়া করে সংক্ষিপ্ত করুন।",
  },
};
