import Routes from "@/assets/data/routes";

export const Data = {
  title: "ঠিকানা সম্পর্কিত তথ্য",
  submit: "ঠিকানা জমা দিন",
  wait: "অপেক্ষা করুন...",

  success: {
    title: "ঠিকানা সম্পর্কিত তথ্য সফলভাবে জমা হয়েছে",
    description:
      "আপনার ঠিকানা সম্পর্কিত তথ্য সফলভাবে জমা হয়েছে। পরবর্তী ধাপের জন্য অনুগ্রহ করে প্রয়োজনীয় তথ্য পূরণ করুন।",
    redirectUrl: Routes.profile_bio.education.create,
  },
  error: {
    title: "ঠিকানা সম্পর্কিত তথ্য সংরক্ষণ করা সম্ভব হয়নি",
    description:
      "আপনার ঠিকানা সম্পর্কিত তথ্য সংরক্ষণ করতে ব্যর্থ হয়েছে। অনুগ্রহ করে আবার চেষ্টা করুন।",
    403: {
      title: "আপনার ঠিকানা সম্পর্কিত তথ্য ইতোমধ্যে বিদ্যমান",
      description: "আপনার পূর্বে তৈরী করা তথ্যটি সম্পাদনা করুন।",
    },
    422: {
      title: "ঠিকানা সম্পর্কিত তথ্য সঠিকভাবে পূরণ করা হয়নি",
      description:
        "আপনার ঠিকানা সম্পর্কিত তথ্য সঠিকভাবে পূরণ করা হয়নি। অনুগ্রহ করে পুনরায় যাচাই করুন এবং আবার চেষ্টা করুন।",
    },
  },
  inputs: {
    permanent_address: {
      title: "স্থায়ী ঠিকানা",
      placeholder: "স্থায়ী ঠিকানা লিখুন",
      suggestions: [
        "বাড়ির নাম বা নম্বর ব্যতীত আপনার স্থায়ী ঠিকানার বিবরণ দিন।",
        "স্থায়ী ঠিকানায় আপনার বসবাসের সময়কাল উল্লেখ করুন।",
      ],
    },
    present_address: {
      title: "বর্তমান ঠিকানা",
      placeholder: "বর্তমান ঠিকানা লিখুন",
      suggestions: [
        "বাড়ির নাম বা নম্বর ব্যতীত আপনার বর্তমান ঠিকানার বিবরণ দিন।",
        "বর্তমান ঠিকানায় আপনার বসবাসের সময়কাল উল্লেখ করুন।",
      ],
    },
    relocate_plan: {
      title: "স্থানান্তর পরিকল্পনা",
      placeholder: "স্থানান্তর পরিকল্পনার বিবরণ দিন",
      suggestions: [
        "আপনার বর্তমান ঠিকানা থেকে স্থানান্তরিত হওয়ার পরিকল্পনা থাকলে তা উল্লেখ করুন।",
      ],
    },
    childhood_address: {
      title: "শৈশবের ঠিকানা",
      placeholder: "শৈশবের ঠিকানা লিখুন",
      suggestions: [
        "শৈশবের সময় আপনি যে স্থানে বড় হয়েছেন তার বিস্তারিত বিবরণ দিন।",
      ],
    },
  },
  unKnownError: {
    title: "একটি সমস্যা হয়েছে!",
    description:
      "দয়া করে সমস্যাটি সমাধানের জন্য সাপোর্ট টিমের সাথে যোগাযোগ করুন এবং সমস্যাটি জানিয়ে দিন।",
  },
};

// Validation Messages
export const VM = {
  permanent_address: {
    required: "স্থায়ী ঠিকানা আবশ্যক।",
    maxLength: "স্থায়ী ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  present_address: {
    maxLength: "বর্তমান ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  relocate_plan: {
    maxLength: "স্থানান্তর পরিকল্পনা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
  childhood_address: {
    maxLength: "শৈশবের ঠিকানা সর্বাধিক ১০০০ অক্ষর হতে পারবে।",
  },
};
